tap "netbirdio/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Automatic configure script builder
brew "autoconf"
# Library for command-line editing
brew "readline"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql@8.4"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Netbird project.
brew "netbirdio/tap/netbird"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Chromium based browser
cask "arc"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
cask "font-jetbrains-mono-nerd-font"
# Menu bar manager
cask "jordanbaird-ice"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# Netbird UI Client
cask "netbird-ui"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# CLI for Yandex Cloud
cask "yandex-cloud-cli"
mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 1545870783
mas "Flow", id: 1423210932
mas "Keynote", id: 409183694
mas "LanguageTool", id: 1534275760
mas "Little Snitch Mini", id: 1629008763
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "OpenIn", id: 1643649331
mas "Owly", id: 882812218
mas "Pages", id: 409201541
mas "Proton Pass for Safari", id: 6502835663
mas "Shadowrocket", id: 932747118
mas "Surfingkeys", id: 1609752330
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "Wipr", id: 1662217862
mas "Yubico Authenticator", id: 1497506650
go "github.com/bootdotdev/bootdev"
go "cmd/go"
go "cmd/gofmt"
