tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jltml/tap"
tap "koekeishiya/formulae"
tap "qmk/qmk"
tap "romkatv/gitstatus"
brew "ack"
brew "antidote"
brew "readline"
brew "autojump"
brew "automake"
brew "libssh2"
brew "bat"
brew "bison"
brew "broot"
brew "btop"
brew "c-ares"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gdbm"
brew "git"
brew "git-delta"
brew "glib"
brew "libksba"
brew "gnupg"
brew "guile"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "lsd"
brew "neovim"
brew "openssh"
brew "python@3.10"
brew "ripgrep"
brew "ruby-build"
brew "ruby-install"
brew "speedtest-cli"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "zlib"
brew "zsh"
cask "j"
cask "orbstack"
