tap "cormacrelf/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jltml/tap"
tap "koekeishiya/formulae"
tap "qmk/qmk"
tap "romkatv/gitstatus"
brew "ack"
brew "antidote"
brew "openssl@3"
brew "readline"
brew "autojump"
brew "automake"
brew "bash-completion@2"
brew "libssh2"
brew "bat"
brew "bison"
brew "broot"
brew "btop"
brew "c-ares"
brew "glib"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gdbm"
brew "git"
brew "git-delta"
brew "libksba"
brew "gnupg"
brew "go"
brew "guile"
brew "ical-buddy"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazygit"
brew "python@3.11"
brew "libffi"
brew "librsvg"
brew "libyaml"
brew "marksman"
brew "neofetch"
brew "neovim"
brew "node"
brew "openssh"
brew "pngpaste"
brew "python@3.10"
brew "ripgrep"
brew "ruby", link: true
brew "ruby-build"
brew "ruby-install"
brew "shellcheck"
brew "speedtest-cli"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "tree"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "cormacrelf/tap/dark-notify"
cask "1password-cli"
cask "bruno"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "orbstack"
cask "sf-symbols"
cask "wezterm"
