tap "homebrew/bundle"
brew "ack"
brew "bat"
brew "bottom"
brew "curlie"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "zstd"
brew "gcc"
brew "git-delta"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "hledger"
brew "httpie"
brew "jnv"
brew "jq"
brew "just"
brew "k9s"
brew "kanata"
brew "kubernetes-cli"
brew "lazygit"
brew "libyaml"
brew "mas"
brew "minikube"
brew "mise"
brew "mysql"
brew "neovim"
brew "ripgrep"
brew "socat"
brew "starship"
brew "stow"
brew "telnet"
brew "tldr"
brew "tmux"
brew "wget"
brew "xcodegen"
brew "yq"
cask "amethyst"
cask "bruno"
cask "font-fira-code"
cask "karabiner-elements"
cask "keycastr"
cask "orbstack"
mas "1Password for Safari", id: 1569813296
mas "Apple Configurator", id: 1037126344
mas "Color Picker", id: 1545870783
mas "Flow", id: 1423210932
mas "Hush", id: 1544743900
mas "Keynote", id: 409183694
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "OpenIn", id: 1643649331
mas "Owly", id: 882812218
mas "Pages", id: 409201541
mas "SimpleLogin", id: 1494051017
mas "SocialFocus", id: 1661093205
mas "Surfingkeys", id: 1609752330
mas "Telegram", id: 747648890
mas "UnTrap", id: 1637438059
mas "Wipr", id: 1662217862
mas "WireGuard", id: 1451685025
mas "Yubico Authenticator", id: 1497506650
