rupa/z
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting

belak/zsh-utils path:editor
belak/zsh-utils path:history
belak/zsh-utils path:prompt
belak/zsh-utils path:utility
belak/zsh-utils path:completion

chrissicool/zsh-256color
"MichaelAquilina/zsh-you-should-use"
vasyharan/zsh-brew-services

